{
  "title": "DreamFi Mobile Application Terms & Conditions",
  "updatedAt": [2025, 3, 18],
  "info": "These terms explain how you can use the DreamFi app, what DreamFi can update or change, and when your access may end if the app is misused.",
  "content": [
    {
      "type": "header",
      "text": "PLEASE READ THE FOLLOWING TERMS AND CONDITIONS VERY CAREFULLY. IF YOU FO NOT AGREE WITH THE FOLLOWING TERMS AND CONDITIONS, DO NOT DOWNLOAD OR INSTALL THIS SOFTWARE. BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE OR ANY PORTION THEREOF, YOU AGREE TO THE FOLLOWING TERMS AND CONDITIONS."
    },
    {
      "type": "spacer"
    },
    {
      "type": "collapsible",
      "header": "Use of the DreamFi Mobile Application",
      "expanded": true,
      "content": [
        {
          "type": "paragraph",
          "content": [
            {
              "type": "text",
              "text": "This agreement (“Terms”) is entered into between you and DreamFi (“DreamFi”), the program partner responsible for managing the DreamFi Checking Account (“DreamFi”). Subject to the provisions of these Terms, you are hereby granted the non-transferable right to use this software (“DreamFi Mobile App”) solely for personal, non-commercial purposes. You may not use the DreamFi Mobile App in any manner that may impair, overburden, damage, disable or otherwise compromise (i) DreamFi’s services; (ii) any other party’s use and enjoyment of DreamFi’s services; or (iii) the services and products of any third parties including, without limitation, any device through which you access the DreamFi Mobile App (the “Authorized Device”). You agree to comply with all local laws and regulations governing the downloading, installation and / or use of the DreamFi Mobile App, including, without limitation, any usage rules set forth in the online application store terms of service. From time to time, DreamFi may automatically check the version of DreamFi Mobile App installed on the Authorized Device and, if applicable, provide updates for the DreamFi Mobile App (“Updates”). Updates may contain, without limitation, bug fixes, patches, enhanced functionality, plug-ins and new versions of the DreamFi Mobile App. By installing the DreamFi Mobile App, you authorize the automatic download and installation of Updates and agree to download and install Updates manually if necessary. Your use of the DreamFi Mobile App and Updates will be governed by these Terms (as amended by any terms and conditions that may be provided with Updates). DreamFi reserves the right to temporarily disable or permanently discontinue any and all functionality of the DreamFi Mobile App at any time without notice and with no liability to you. For the avoidance of doubt, agreement to these Terms is solely between DreamFi and you. If you need to contact DreamFi about the DreamFi Mobile App, you may do so by calling "
            },

            {
              "type": "link",
              "link": "tel:833-637-3266",
              "text": "833-637-3266"
            },
            { "type": "text", "text": "." }
          ]
        }
      ]
    },
    {
      "type": "collapsible",
      "header": "Privacy Policy",
      "content": [
        {
          "type": "text",
          "text": "As a condition of using the DreamFi Mobile App, you acknowledge that additional agreements may be in place that govern your relationship with DreamFi, including but not limited to the DreamFi Deposit Account Agreement, DreamFi Privacy Policy, the DreamFi User Agreement and the Electronic Communication Agreement, each of which is hereby incorporated by reference (collectively referred to as “DreamFi Agreements”). You acknowledge and agree that DreamFi Agreements may be updated from time to time, without prior notice. Any such change(s) will be effective as soon as DreamFi posts a revised version of that DreamFi Agreement. In the event of an otherwise irreconcilable conflict between these Terms and DreamFi Agreements, these Terms will govern, solely with regard to the conflicting provisions and solely to the extent of such conflict. DreamFi may track and archive certain information regarding your use of the DreamFi Mobile App (“Use Information”). Use Information may be stored and processed in the United States or any other country in which DreamFi or its agents maintain facilities. By using the DreamFi Mobile App, you consent to the collection of your User Information and to any transfer of your User Information outside of your country."
        }
      ]
    },
    {
      "type": "collapsible",
      "header": "Proprietary Rights",
      "content": [
        {
          "type": "text",
          "text": "You hereby acknowledge that DreamFi owns all rights, titles, and interest in and to the DreamFi Mobile App and to any and all proprietary and confidential information contained therein (“DreamFi Information”). The DreamFi Mobile App and DreamFi Information are protected by applicable intellectual property and other laws, including patent law, copyright law, trade secret law, trademark law, unfair competition law, and any and all other proprietary rights, and any and all applications, renewals, extensions and restorations thereof, now or hereafter in force and effect worldwide. You agree that you will not (and will not allow any third party to) (i) modify, adapt, translate, prepare derivative works from, decompile, reverse engineer or disassemble the DreamFi Mobile App or otherwise attempt to derive source code from the DreamFi Mobile App; (ii) copy, distribute, transfer, sell or license the DreamFi Mobile App; (iii) transfer the DreamFi Mobile App to, or use the DreamFi Mobile App on, a device other than the Authorized Device; (iv) take any action to circumvent, compromise or defeat any security measures implemented in the DreamFi Mobile App; (v) use the DreamFi Mobile App to access, copy, transfer, retransmit or transcode Content (as defined below) or any other content in violation of any law or third party rights; (vi) remove, obscure, or alter DreamFi’s (or any third party’s) copyright notices, trademarks, or other proprietary rights notices affixed to or contained within or accessed through the DreamFi Mobile App.Content made available through the DreamFi Mobile App (“Content”) is protected by applicable intellectual property rights and is the property of DreamFi, its third-party licensors and partners (as applicable), and other entities that provide such content to DreamFi. You may not (or enable others to) copy, distribute, display, modify, or otherwise use the Content except as it is provided to you through the DreamFi Mobile App hereunder. DreamFi and its licensors make no representations or warranties regarding the accuracy or completeness of the Content."
        }
      ]
    },
    {
      "type": "collapsible",
      "header": "Export Restrictions",
      "content": [
        {
          "type": "text",
          "text": "DreamFi does not represent that the DreamFi Mobile App is appropriate or available for use in any geographical location. Any entity choosing to use the DreamFi Mobile App is solely responsible for compliance with all applicable laws. The DreamFi Mobile App is subject to U.S. export controls and may not be downloaded, exported or re-exported: (i) into any country with respect to which the United States maintains trade sanctions prohibiting the shipment of goods; or (ii) to anyone on or acting on behalf of an entity on the U.S. Treasury Department’s list of Specially Designated Nationals and Blocked Persons or the U.S. Commerce Department’s Denied Persons List or Entities List or included in General Order 3 (15 C.F.R. Part 736, Supplement 1), which prohibits exports to Mayrow General Trading, affiliated entities and persons, and specified persons involved in the manufacture or sale of Improvised Explosive Devices (together referred to as “U.S. Prohibited Party Lists”). By downloading and / or using the DreamFi Mobile App, you represent and warrant that you are not (a) located in or a national or resident of any country noted above or any country that is subject to U.S. trade sanctions, or (b) on any U.S. Prohibited Party List or acting on behalf of any person or entity on any such list."
        }
      ]
    },
    {
      "type": "collapsible",
      "header": "Termination",
      "content": [
        {
          "type": "text",
          "text": "You may terminate acceptance of these Terms at any time by permanently deleting the DreamFi Mobile App in its entirety from the Authorized Device, whereupon (and without notice from DreamFi) any rights granted to you herein will automatically terminate. If you fail to comply with any provision of these Terms, any rights granted to you herein will automatically terminate. In the event of such termination, you must immediately delete the DreamFi Mobile App from the Authorized Device."
        }
      ]
    },
    {
      "type": "collapsible",
      "header": "Indemnity",
      "content": [
        {
          "type": "text",
          "text": "You agree to indemnify and hold harmless DreamFi and its subsidiaries, affiliates, officers, agents, and employees (and their subsidiaries, affiliates, officers, agents, and employees) against any and all claims, suits or actions arising from or in any way related to your use of the DreamFi Mobile App or these Terms, including any liability or expense arising from all claims, losses, damages, suits, judgments, litigation costs and attorneys’ fees, of every kind and nature. In such a case, DreamFi will provide you with written notice of such claim, suit or action."
        }
      ]
    },
    {
      "type": "collapsible",
      "header": "Entire Agreement; Revisions to Terms",
      "content": [
        {
          "type": "text",
          "text": "DreamFi may, from time to time, modify these Terms. Such modifications shall be effective as soon as the modified version of the “DreamFi Mobile Terms of Use” is posted in the online application store or any other authorized DreamFi Mobile App distribution location. You can determine when these Terms were last revised by referring to the “LAST UPDATED” legend at the top of the then-current version of the “DreamFi Mobile Terms of Use” in the online application store or any other authorized DreamFi Mobile App distribution location. Your use of the DreamFi Mobile App following such changes constitutes your acceptance of the revised version of the “DreamFi Mobile Terms of Use” in the online application store or any other authorized DreamFi Mobile App distribution location."
        }
      ]
    }
  ]
}
